package zh

/** --------------------------------------------- *
 * @filename   zhCN/
 * @author     jinycoo <caojingyin@jiandan100.cn>
 * @datetime   2019-05-25 17:49
 * @version    1.0.0
 * @desc       .....
 * ---------------------------------------------- */

var ZH_CN = map[int]string {
	0:    "ok",
	-1:   "应用程序不存在或已被封禁",
	-2:   "Access Key错误",
	-3:   "API校验密匙错误",
	-4:   "调用方对该Method没有权限",
	-5:   "状态错误",
	-6:   "状态无效",
	-7:   "参数错误",
	-8:   "未找到请求数据",
	-9:   "数据错误",
	-101: "账号未登录",
	-102: "账号被封停",
	-103: "网络错误，需要重新登录",
	-105: "验证码错误",
	-106: "账号未激活",
	-107: "账号非正式会员或在适应期",
	-108: "应用不存在或者被封禁",
	-110: "未绑定手机",
	-111: "csrf 校验失败",
	-112: "系统升级中",
	-113: "账号尚未实名认证",
	-114: "请先绑定手机",
	-115: "请先完成实名认证",
	-304: "木有改动",
	-307: "撞车跳转",
	-400: "请求错误",
	-401: "未认证",
	-403: "访问权限不足",
	-404: "啥都木有",
	-405: "不支持该方法",
	-409: "冲突",

	-500: "服务器错误",
	-503: "过载保护,服务暂不可用",
	-504: "服务调用超时",
	-509: "超出限制",

	-600: "Token错误",
	-601: "Token尚未激活",
	-602: "登录状态已过期",
	-603: "无效Token",

	-616: "上传文件不存在",
	-617: "上传文件太大",
	-625: "登录失败次数太多",
	-626: "用户不存在",
	-627: "密码错误",
	-628: "密码太弱",
	-629: "用户名或密码错误",
	-632: "操作对象数量限制",
	-643: "被锁定",
	-650: "用户等级太低",
	-652: "重复的用户",
	-658: "登录状态已过期",
	-659: "Token参数缺失",
	-662: "密码时间戳过期",
	-688: "地理区域限制",
	-689: "版权限制",


	-700: "账号无效",
	-701: "账号未登录",
	-702: "账号未激活",
	-703: "账号被封停",
	-704: "账号不存在",
	-705: "账号已存在",

	-1000: "网络连接错误",
	-1200: "被降级过滤的请求",
	-1201: "rpc服务的client都不可用",
	-1202: "rpc服务的client没有授权",
	-1203: "rpc服务配置错误",
	-2201: "rpc服务的server端不可用",
	-2202: "rpc服务的server端错误",

	70100: "该科目不存在",
	70110: "学段错误",
	70120: "该学段暂未分配学科",
	70140: "订单已存在",
	70150: "订单学员不存在",
	70200: "学管师不存在",

	71000: "教务学管师主代理1账号错误", // DeanEruGuiderMProxyOErr
	71001: "教务学管师主代理2账号错误", // DeanEruGuiderMProxyTErr

	3001: "输入的主代理账号无效",
}

